package operations

type Operation int

const (
	Exit Operation = iota
	CalcValue
	SetupNaturalCond
	SetupStart
	SetupStartEnd
	ComparePolynomials
)

func (op Operation) String() string {
	return []string{
		"Выход из программы.",
		"Вычислить значение",
		"Установить естественные краевые условия",
		"Установить phi''(x0) == P''(x0) (полином Ньютона 3 степ.)",
		"Установить phi''(x0) == P''(x0) и phi''(xn) == P''(xn)",
		"Сравнить результаты в центре и на границах таблицы",
	}[op]
}

const header string = `=========================================================================================
|                  Интерполяция с помощью сплайна и полинома Ньютона                    |
-----------------------------------------------------------------------------------------
| Операции                                                                              |
|---------------------------------------------------------------------------------------|`

const line string = "-----------------------------------------------------------------------------------------\n"
const emptyLine string = "|                                                                                       |\n"
